{
  "play": "Play Game",
  "howToPlay": "How to Play",
  "settings": "Settings",
  "account": "Account",
  "credits": "Credits",
  "back": "Menu",
  "score": "Score: 🎖️",
  "bestScore": "Best: 🏆",
  "liveChat": "Live Chat",
  "chatPlaceholder": "Type a message...",
  "send": "Send",
  "pausedMessage": "Take a breath and continue...",
  "globalRanking": "Global Ranking 🏆",
  "languageLabel": "Language",
  "no": "No",
  "yesRestart": "Yes, restart",
  "howToPlayControlsTitle": "Controls",
  "howToPlayControlsDesc1": "Use the <strong>arrow keys</strong> or <strong>WASD</strong> to move the snake.",
  "howToPlayControlsDesc2": "Use the <strong>spacebar</strong> to pause the game.",
  "howToPlayObjectiveTitle": "Objective",
  "howToPlayObjectiveDesc1": "Eat the food to grow and score points. But be careful! For every <strong>10 points</strong>, the snake will increase its speed.",
  "howToPlayObjectiveDesc2": "Avoid hitting the walls, the <strong>obstacles</strong> (gray blocks that appear randomly), or your own body.",
  "howToPlayPowerUpsTitle": "Power-Ups",
  "howToPlayPowerUpsDesc": "Collect the geometric shapes to activate special abilities:",
  "creditsRole": "🎨 UI/UX Designer & Developer",
  "creditsLine1": "Pixel by pixel, stroke by stroke, every interface and sound in this game is born from an obsession: transforming nostalgia into the future.",
  "creditsLine2": "With over six years of designing digital products in tech, Web3, and video games, my approach combines modular precision, retro-futurista aesthetics, and a deep empathy for the player. I don't just design screens: I build atmospheres, intuitive flows, and micro-interactions that tell stories without words.",
  "creditsLine3": "I work with visual systems that breathe coherence, wireframes that anticipate decisions, and processes that respect both logic and emotion. Every element here—from the glint of a pixel to the echo of a sound—is designed to make the experience clear, immersive, and memorable.",
  "creditsLine4": "This Snake is not just a game. It's a design capsule, a visual statement, and a love letter to those who believe that digital can also be art.",
  "creditsDonation": "🪙 If you liked this project and want to support its evolution, you can make a donation to help me continue developing new visual variants, pixel art effects, micro-interactions, and advanced compatibility with Linux environments. Every contribution drives the creation of more polished, modular, and accessible experiences for everyone. Thanks for being part of this retro-futurista mission! 💜.",
  "creditsBitcoin": "Bitcoin: bc1qngxlgsz3tj6v9kkgumv0fnrf7fsfn9wjesjghr",
  "creditsUsdt": "USDT (TRON): TL3Vwuyf1iA86nB6vzXiNbtgdYBrWLxEEi",
  "modeSelectionTitle": "Choose a game mode",
  "modeNormal": "Normal",
  "modeObstacles": "With Obstacles",
  "startGame": "Start Game",
  "powerupSlowDownDesc": "Reduces the snake's speed, giving you more time to react.",
  "powerupDoublePointsDesc": "It's worth double! Each piece of food gives you double the points.",
  "powerupImmunityDesc": "Makes you invulnerable. Go through walls and obstacles without fear.",
  "powerupShrinkDesc": "Reduces the size of your snake, making you more agile.",
  "powerupClearObstaclesDesc": "Total cleaning! Removes all obstacles from the board.",
  "powerupBombDesc": "Watch out! Subtracts points and repositions the food."
}