{
  "play": "Iniciar Juego",
  "howToPlay": "Cómo Jugar",
  "settings": "Configuración",
  "account": "Cuenta",
  "credits": "Créditos",
  "back": "Menú",
  "score": "Puntos: 🎖️",
  "bestScore": "Record: 🏆",
  "liveChat": "Chat en Vivo",
  "chatPlaceholder": "Escribe un mensaje...",
  "send": "Enviar",
  "pausedMessage": "Respira un poco y continua...",
  "globalRanking": "Ranking Global 🏆",
  "languageLabel": "Idioma",
  "no": "No",
  "yesRestart": "Sí, reiniciar",
  "howToPlayControlsTitle": "Controles",
  "howToPlayControlsDesc1": "Usa las <strong>teclas de flecha</strong> o <strong>WASD</strong> para mover la serpiente.",
  "howToPlayControlsDesc2": "Usa la <strong>barra espaciadora</strong> para pausar el juego.",
  "howToPlayObjectiveTitle": "Objetivo",
  "howToPlayObjectiveDesc1": "Come la comida para crecer y sumar puntos. ¡Pero cuidado! Por cada <strong>10 puntos</strong>, la serpiente aumentará su velocidad.",
  "howToPlayObjectiveDesc2": "Evita chocar contra las paredes, los <strong>obstáculos</strong> (bloques grises que aparecen aleatoriamente) o tu propio cuerpo.",
  "howToPlayPowerUpsTitle": "Power-Ups",
  "howToPlayPowerUpsDesc": "Recoge las figuras geométricas para activar habilidades especiales:",
  "creditsRole": "🎨 Diseñador de UI/UX y desarrollador",
  "creditsLine1": "Pixel por pixel, trazo por trazo, cada interfaz y sonido de este juego nace de una obsesión: transformar la nostalgia en futuro.",
  "creditsLine2": "Con más de seis años diseñando productos digitales en tecnología, Web3 y videojuegos, mi enfoque combina precisión modular, estética retro-futurista y una profunda empatía por el jugador. No solo diseño pantallas: construyo atmósferas, flujos intuitivos y microinteracciones que cuentan historias sin palabras.",
  "creditsLine3": "Trabajo con sistemas visuales que respiran coherencia, wireframes que anticipan decisiones, y procesos que respetan tanto la lógica como la emoción. Cada elemento aquí —desde el brillo de un píxel hasta el eco de un sonido— está pensado para que la experiencia sea clara, envolvente y memorable.",
  "creditsLine4": "Este Snake no es solo un juego. Es una cápsula de diseño, una declaración visual, y una carta de amor a quienes creen que lo digital también puede ser arte.",
  "creditsDonation": "🪙 Si te gustó este proyecto y quieres apoyar su evolución, puedes hacer una donación para ayudarme a seguir desarrollando nuevas variantes visuales, efectos pixelart, microinteracciones y compatibilidad avanzada con entornos Linux. Cada aporte impulsa la creación de experiencias más pulidas, modulares y accesibles para todos. ¡Gracias por ser parte de esta misión retro-futurista! 💜.",
  "creditsBitcoin": "Bitcoin : bc1qngxlgsz3tj6v9kkgumv0fnrf7fsfn9wjesjghr",
  "creditsUsdt": "USDT (TRON): TL3Vwuyf1iA86nB6vzXiNbtgdYBrWLxEEi",
  "modeSelectionTitle": "Elige un modo de juego",
  "modeNormal": "Normal",
  "modeObstacles": "Con Obstáculos",
  "startGame": "Iniciar Juego",
  "powerupSlowDownDesc": "Reduce la velocidad de la serpiente, dándote más tiempo para reaccionar.",
  "powerupDoublePointsDesc": "¡Vale el doble! Cada pieza de comida te da el doble de puntos.",
  "powerupImmunityDesc": "Te vuelve invulnerable. Atraviesa muros y obstáculos sin miedo.",
  "powerupShrinkDesc": "Reduce el tamaño de tu serpiente, haciéndote más ágil.",
  "powerupClearObstaclesDesc": "¡Limpieza total! Elimina todos los obstáculos del tablero.",
  "powerupBombDesc": "¡Cuidado! Resta puntos y reposiciona la comida."
}